# GetItemFolders Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetItemFolders Method
FabricationConfiguration Class See Also
---
Gets a list of every fabrication item folder in the fabrication item folder structure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public IList<FabricationItemFolder> GetItemFolders()
```

Visual Basic
---
```text
Public Function GetItemFolders As IList(Of FabricationItemFolder)
```

Visual C++
---
```text
public:
IList<FabricationItemFolder^>^ GetItemFolders()
```

# ### Return Value
Returns a list of every fabrication item folder in the fabrication item folder structure.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The current fabrication configuration is not connected and updated to source configuration. Reload and try again. |

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace